### Terraform Plan: Success ✅
---
#### Terraform Format and Style 🚀`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
plan<<DsvTQ4reMpk8kVOXy3UV

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.lambda_functions.aws_lambda_event_source_mapping.sqs_trigger will be created
  + resource "aws_lambda_event_source_mapping" "sqs_trigger" {
      + arn                           = (known after apply)
      + batch_size                    = 5
      + enabled                       = true
      + event_source_arn              = "arn:aws:sqs:us-east-1:904106077871:fiap-lumiere-source-files-events-queue"
      + function_arn                  = (known after apply)
      + function_name                 = (known after apply)
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + tags_all                      = (known after apply)
      + uuid                          = (known after apply)

      + amazon_managed_kafka_event_source_config (known after apply)

      + self_managed_kafka_event_source_config (known after apply)
    }

  # module.lambda_functions.aws_lambda_function.media_processor will be created
  + resource "aws_lambda_function" "media_processor" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "/home/runner/work/fiap-lumiere-infra-iac/fiap-lumiere-infra-iac/.terraform/tmp/lambda_function_Dev.zip"
      + function_name                  = "FiapLumiereMediaProcessorLambda"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::904106077871:role/LabRole"
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "JqHAJ5q8+PvpVtiGP/s3lieQk07+/3u9Ekd6VRr/5V8="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
        }
      + tags_all                       = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.sqs_queues.data.aws_iam_policy_document.result_files_events_queue_policy_doc will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "result_files_events_queue_policy_doc" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:904106077871:fiap-lumiere-result-files-events-queue",
            ]

          + condition {
              + test     = "ArnLike"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:SourceArn"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "904106077871",
                ]
              + variable = "aws:SourceAccount"
            }

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.sqs_queues.aws_sqs_queue_policy.result_files_events_queue_policy will be created
  + resource "aws_sqs_queue_policy" "result_files_events_queue_policy" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = "https://sqs.us-east-1.amazonaws.com/904106077871/fiap-lumiere-result-files-events-queue"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
DsvTQ4reMpk8kVOXy3UV
```

</details>

*Pushed by: @WesleySangalli, Action: `pull_request`*